{
  "work_experience": {
    "title": "Work Experience",
    "description": "Here are some of the companies I've worked for and the projects I've worked on.",
    "companies": {
      "1": {
        "company": {
          "name": "MiTAC",
          "href": "https://www.mitac.com/en-global"
        },
        "job_title": "Software Engineer / Intern",
        "description": "Enhance the architecture of the old system to improve program efficiency, add/remove/modify original functions, and adjust the report generation method.\n\n[Implementation Approach]\nFrontend: JSP with JavaScript, jQuery, AJAX.\nBackend: Java, Spring MVC, JPA.\nDatabase: DB2.\nReporting: Birt.\n\n- Participated in the development of functionalities for the Foreign Exchange MVC system, and assisted with functionality testing and stress testing.\n- Revamped the internal legacy system of a bank, developing both the frontend and backend using Java and JSP."
      },
      "2": {
        "company": {
          "name": "Wits - Acer",
          "href": "https://www.wits.com/en"
        },
        "job_title": "Frontend Developer",
        "description": "- Independently developed Overwolf app - ProClip, an application that automatically recognizes and records gaming highlights, making it easy to share on social platforms.\n- Use React framework to develop the frontend architecture, integrated Overwolf SDKs, and managed state with React-Redux.\n- I use Tailwind CSS framework for styling and use TypeScript standards throughout the entire architecture.\n- Planned and implemented appropriate data structures for data storage and integrated APIs for social sharing functionalities.\n- Since its release, ProClip has achieved 3,500 downloads, 250 daily active users, and has generated over 10,000 reach on its fan page. Currently planned to preload onto the company's own platform."
      },
      "3": {
        "company": {
          "name": "Wits - Trend Micro",
          "href": "https://www.wits.com/en"
        },
        "job_title": "Frontend Developer",
        "description": "- Develop and maintain the product support website, assisting customers with troubleshooting, product inquiries, and service updates.\n- Integrate chatbot solutions to enhance user experience.\n- Develop the product service status website, ensuring accurate and real-time information on product availability and system health.\n- Collaborate closely with cross-functional teams to improve product features and ensure seamless integration of support tools."
      }
    }
  }
}
